from pymongo import MongoClient

# 1. 连接 MongoDB
client = MongoClient("mongodb://localhost:27017/")
db = client["food_recommendation_db"]  # 替换为你的数据库名
collection = db["merchants"]  # 替换为你的集合名


# for doc in collection.find():
#     print(doc['name'])


shop_tags = [
    {
        "name": "御品片皮鸭(武大校园店)",
        "tags": [
            ["粤菜", "东北菜"],
            ["快餐店"],
            ["热菜", "小吃"]
        ]
    },
    {
        "name": "鱼你在一起(武汉大学店)",
        "tags": [
            ["川菜"],
            ["快餐店"],
            ["热菜"]
        ]
    },
    {
        "name": "鲜炖大碗牛腩饭(武大店)",
        "tags": [
            ["粤菜"],
            ["快餐店"],
            ["主食", "热菜"]
        ]
    },
    {
        "name": "小熊荷包鸡(武大校园总店)",
        "tags": [
            ["粤菜"],
            ["小吃店"],
            ["热菜", "小吃"]
        ]
    },
    {
        "name": "北京烤鸭(武大校园店)",
        "tags": [
            ["东北菜"],
            ["快餐店"],
            ["热菜"]
        ]
    },
    {
        "name": "东北菜饺子馆(武大校园店)",
        "tags": [
            ["东北菜"],
            ["小吃店"],
            ["主食", "小吃"]
        ]
    },
    {
        "name": "乐芝士·中国披萨(武大枫园食堂店)",
        "tags": [
            ["西北菜"],
            ["西餐厅"],
            ["主食", "小吃"]
        ]
    },
    {
        "name": "生煎锅贴汤包(武大校园店)",
        "tags": [
            ["江浙菜"],
            ["小吃店"],
            ["小吃"]
        ]
    },
    {
        "name": "阿疆X味·新疆炒米粉(武大校内店)",
        "tags": [
            ["西北菜"],
            ["小吃店"],
            ["热菜"]
        ]
    },
    {
        "name": "郭记手撕鸡(武大校内店)",
        "tags": [
            ["鄂菜"],
            ["小吃店"],
            ["凉菜", "热菜"]
        ]
    },
    {
        "name": "关东水饺(武大校园店)",
        "tags": [
            ["东北菜"],
            ["小吃店"],
            ["主食"]
        ]
    },
    {
        "name": "香茵波克现烤汉堡(武大校区店)",
        "tags": [
            ["西餐厅"],
            ["快餐店"],
            ["主食"]
        ]
    },
    {
        "name": "黑粉你·肥牛火锅粉(武大校园店)",
        "tags": [
            ["川菜"],
            ["火锅店"],
            ["热菜", "汤类"]
        ]
    },
    {
        "name": "黄饷·咖喱蛋包饭(信部CBD可送宿舍店)",
        "tags": [
            ["江浙菜"],
            ["快餐店"],
            ["主食"]
        ]
    },
    {
        "name": "煎百味·煎饼卤粉(武大信息店)",
        "tags": [
            ["湘菜"],
            ["小吃店"],
            ["小吃"]
        ]
    },
    {
        "name": "LOOKING韩式炸鸡(武大校园直送店)",
        "tags": [
            ["西餐厅"],
            ["快餐店"],
            ["小吃"]
        ]
    },
    {
        "name": "土家酱香饼(武大校园店)",
        "tags": [
            ["鄂菜"],
            ["小吃店"],
            ["小吃"]
        ]
    },
    {
        "name": "研卤堂·卤味拌饭(武汉大学枫园店)",
        "tags": [
            ["湘菜"],
            ["小吃店"],
            ["热菜"]
        ]
    },
    {
        "name": "珞家冒菜(武大工学部田园店)",
        "tags": [
            ["川菜"],
            ["火锅店"],
            ["热菜"]
        ]
    },
    {
        "name": "首尔欧巴炸鸡(武大店)",
        "tags": [
            ["西餐厅"],
            ["快餐店"],
            ["小吃"]
        ]
    },
    {
        "name": "武大擂椒木桶饭(武大校内店)",
        "tags": [
            ["湘菜"],
            ["快餐店"],
            ["主食"]
        ]
    },
    {
        "name": "大学生都爱吃的格子饭(武大店)",
        "tags": [
            ["快餐店"],
            ["主食"]
        ]
    },
    {
        "name": "熊猫盖码饭(武大校内店)",
        "tags": [
            ["湘菜"],
            ["快餐店"],
            ["主食"]
        ]
    },
    {
        "name": "马氏现卤鸭脖(武大校园店)",
        "tags": [
            ["鄂菜"],
            ["小吃店"],
            ["凉菜", "小吃"]
        ]
    },
    {
        "name": "正新鸡排(武大直送店)",
        "tags": [
            ["西餐厅"],
            ["快餐店"],
            ["小吃"]
        ]
    },
    {
        "name": "灿灿餐厅(武大校内可送店)",
        "tags": [
            ["粤菜"],
            ["快餐店"],
            ["热菜"]
        ]
    },
    {
        "name": "小肆川(武大梅园店)",
        "tags": [
            ["川菜"],
            ["火锅店"],
            ["热菜"]
        ]
    },
    {
        "name": "武大家常菜(武大校内店)",
        "tags": [
            ["鄂菜"],
            ["快餐店"],
            ["热菜"]
        ]
    },
    {
        "name": "徐记养生粥(现熬粥铺武大店)",
        "tags": [
            ["饮品店"],
            ["汤类", "饮品"]
        ]
    },
    {
        "name": "宝岛小厨(武大工学部店)",
        "tags": [
            ["粤菜"],
            ["快餐店"],
            ["热菜"]
        ]
    },
    {
        "name": "安代表·新韩式炸鸡(武大校园店)",
        "tags": [
            ["西餐厅"],
            ["快餐店"],
            ["小吃"]
        ]
    },
    {
        "name": "小伙计(武大可送校内店)",
        "tags": [
            ["东北菜"],
            ["快餐店"],
            ["热菜"]
        ]
    },
    {
        "name": "周麻婆·川菜现炒大王(湖北武汉大学店)",
        "tags": [
            ["川菜"],
            ["快餐店"],
            ["热菜"]
        ]
    },
    {
        "name": "胖大富蒜香排骨(武大珞珈门店)",
        "tags": [
            ["粤菜"],
            ["小吃店"],
            ["小吃"]
        ]
    },
    {
        "name": "大米先生(樱花大厦店)",
        "tags": [
            ["江浙菜"],
            ["快餐店"],
            ["主食"]
        ]
    },
    {
        "name": "辛香盖码饭(武大校内直达宿舍店)",
        "tags": [
            ["湘菜"],
            ["快餐店"],
            ["主食"]
        ]
    },
    {
        "name": "超牛堡·炙烤牛肉汉堡(南湖店)",
        "tags": [
            ["西餐厅"],
            ["快餐店"],
            ["主食"]
        ]
    }
]

# # 2. 读取所有文档并添加标签
for i,doc in enumerate(collection.find()):  # 遍历每一条记录
    # # 检查是否已有标签（避免重复更新）
    # if "tag" not in doc:
    # 定义你的标签逻辑（例如基于某个字段）
    # new_tag = "default_tag"
    # if "category" in doc:
    #     new_tag = f"category_{doc['category']}"

    # 更新当前文档，添加 `tag` 字段
    tags=shop_tags[i]['tags']
    category=[]
    for tag in tags:
        category+=tag
    # print(category)
    collection.update_one(
        {"_id": doc["_id"]},  # 用 _id 匹配当前文档
        {"$set": {"catogery": category}},
    )

# 3. 关闭连接
client.close()